

# songs = {
#     "everything": '검정치마의 "everything" 좋아하시나 봐요! 저도 그 노래 정말 좋아해요!\n"너는 내 모든 것. 너가 무엇을 해도 나의 전부야."\n라는 예쁜 의미를 가지고 있어요.',
#     "에브리띵": '검정치마의 everything 좋아하시나 봐요! 저도 그 노래 정말 좋아해요!\n"너는 내 모든 것. 너가 무엇을 해도 나의 전부야."\n라는 예쁜 의미를 가지고 있어요.',

#     "한시 오분": '검정치마의 "한시 오분" 좋아하세요? 저도 그래요!\n"흑백영화 처럼 사랑하고.." 무슨 의미일까요?\n딱히 자극적이지 않은 사랑이지만 흑백영화 처럼 오래되고, 변하지 않는다는 뜻일까요?',
#     "한시 오분 (1:05)": '검정치마의 "한시 오분" 좋아하세요? 저도 그래요!\n"흑백영화 처럼 사랑하고.." 무슨 의미일까요?\n딱히 자극적이지 않은 사랑이지만 흑백영화 처럼 오래되고, 변하지 않는다는 뜻일까요?',

#     "노페인": '실리카겔의 "NO PAIN", 개인적으로 들으면 속이 뚫리는 음악이에요!\n"NO PAIN, NO FAIL. 음악 없는 세상."\n음악이 없다면 고통도 없고 아무것도 느낄 수 없다는 의미일까요?',
#     "no pain": '실리카겔의 "NO PAIN", 개인적으로 들으면 속이 뚫리는 음악이에요!\n"NO PAIN, NO FAIL. 음악 없는 세상."\n음악이 없다면 고통도 없고 아무것도 느낄 수 없다는 의미일까요?',

#     "루드" : 'Harts2Harts의 "RUDE!" 감이 있다 확실히.\n하우스 음악 명가 SM 답게 깔끔하고 군더더기 없는 노래잖아요!\n저는 개인적으로 "I couldn' "'" 't even care, less!"라는 스텔라의 벌스가 제일 좋아요!',
#     "rude" : 'Harts2Harts의 "RUDE!" 감이 있다 확실히.\n하우스 음악 명가 SM 답게 깔끔하고 군더더기 없는 노래잖아요!\n저는 개인적으로 "I couldn' "'" 't even care, less!"라는 스텔라의 벌스가 제일 좋아요!',
#     "rude!" : 'Harts2Harts의 "RUDE!" 감이 있다 확실히.\n하우스 음악 명가 SM 답게 깔끔하고 군더더기 없는 노래잖아요!\n저는 개인적으로 "I couldn' "'" 't even care, less!"라는 스텔라의 벌스가 제일 좋아요!',

#     "404" : 'Kii Kii(키키)의 "404(New Era)", 약간 저도 이 노래에 애정이 가요. 저랑 같은 계열의 음악이에요..\n"404 Not Found On The System" 개발자라면 누구나 보기 싫어하는 글입니다.'
    

    
# }

# name = input("Q : 안녕하세요! 이름이 어떻게 되나요?\nA : ")

# while True:
#     song = input(f"Q : 안녕하세요. {name}님!\n'junseong's playlist'에서 좋아하는 노래가 있나요? (종료는 x)\nA : ").lower()

#     if song == "x":
#         print(f"대화를 종료할게요. 다음에 또 봐요 {name}님!")
#         break

#     if song in songs:
#         print(songs[song])

#         if song == "404":
#             print(f"하지만? 저는 {name}님이 좋다고 하셔서 좋아요.")
#     else:
#         print("그 노래는 플레이리스트에 없어요!")
